# DAY3

In [17]:
import numpy as np
import pandas as pd
df=pd.DataFrame([[99,87],[np.nan,92],[np.nan,56]]
               ,columns=['1st Term','2nd Term'],
                index=['John','Dave','Bright']
               )
df

        1st Term  2nd Term
John        99.0        87
Dave         NaN        92
Bright       NaN        56

In [19]:
#check missing values using isnull() function

In [25]:
df.isnull()

        1st Term  2nd Term
John       False     False
Dave        True     False
Bright      True     False

In [38]:
#Create series to find all records where 1st term is NULL
t=(df['1st Term']).isnull()
t

John      False
Dave       True
Bright     True
Name: 1st Term, dtype: bool

In [39]:
type(t)

pandas.core.series.Series

In [40]:
df[t]

        1st Term  2nd Term
Dave         NaN        92
Bright       NaN        56

In [42]:
#Check using notnull() function
df.notnull()

        1st Term  2nd Term
John        True      True
Dave       False      True
Bright     False      True

In [44]:
#fillna(): to replace NA with fucntion values

df.fillna(0)

        1st Term  2nd Term
John        99.0        87
Dave         0.0        92
Bright       0.0        56

In [45]:
#replace using backfill method with next values
df.fillna(method="bfill")

        1st Term  2nd Term
John        99.0        87
Dave         NaN        92
Bright       NaN        56

In [48]:
#replace using forwardfill method with previous value
df.fillna(method="pad")

        1st Term  2nd Term
John        99.0        87
Dave        99.0        92
Bright      99.0        56

In [60]:
#fill values in a certain column
#inplace=True, performs it on data and doesnt return anything while inplace=False creates a new copy of data
df["1st Term"].fillna('No values', inplace=True)
df

         1st Term  2nd Term
John           99        87
Dave    No values        92
Bright  No values        56

In [61]:
#replace() function to replace values
df.replace(to_replace='No values',value=-99)

        1st Term  2nd Term
John        99.0        87
Dave       -99.0        92
Bright     -99.0        56

In [63]:
#interpolate()
df.interpolate(method='linear',limit_direction='forward')

         1st Term  2nd Term
John           99        87
Dave    No values        92
Bright  No values        56